<a href="https://colab.research.google.com/github/aiakobson/Digital_technologies/blob/main/%D0%9A%D0%BE%D0%BF%D0%B8%D1%8F_%D0%B1%D0%BB%D0%BE%D0%BA%D0%BD%D0%BE%D1%82%D0%B0_%22DT2024_NB2_SQL_empty_jpynb%22.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To work with this notebook, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook. Source: Some Items from the Moringa Data Science Course.  

Skeleton notebook for class exercises

*</font>

# SQL Programming - Getting Started with Databases

## 1.1 Overview

Structured Query Language (SQL) is the language that is used to store, manipulate and retrieve data from many databases. It is the standard language for many relational database management systems which are a type of databases used by organisations across the world. These type of relational database management systems are used to store data in tables and examples of such include SQLite, MySQL, Postgres, Oracle etc.

During DT course, we will learn about SQL since we may be required to retrieve data from databases through the use of SQL.

In this notebook, we will use SQL to learn how tables in databases are created. More specifically, we will learn how the structure of tables is defined which is critical in determining the quality of data. The better the structure, the easier it becomes to clean data.

## 1.2 Connecting to our Database

In [6]:
!pip install sqlalchemy==2.0
#!pip install sqlalchemy==1.4.4

# We will first load an sql extension into our environment
# This extension will allow us to work with sql on Colaboratory
#
%load_ext sql

# We will then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed.
# We will learn more about how databases are created later in prep.
#
%sql sqlite:///mydb.sqlite

Requirement already satisfied: sqlalchemy==2.0 in /usr/local/lib/python3.10/dist-packages (2.0.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (4.10.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (3.0.3)
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## 1.3 Creating a Table

In [21]:
# Example 1
# We will now define and create a table STUDENT in our database (if it doesn't exist).
# This table will have fields: StudentID, LastName as shown below.
# We will then fetch all records from the table.
#
%sql CREATE TABLE STUDENT (StudentID, LastName);

 * sqlite:///mydb.sqlite
Done.
 * sqlite:///mydb.sqlite
(sqlite3.OperationalError) table COURSE already exists
[SQL: CREATE TABLE COURSE (CourseId, Name);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///mydb.sqlite
(sqlite3.OperationalError) table GRADE already exists
[SQL: CREATE TABLE GRADE (StudentID, CourseID, Grade);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## 1.4 Inserting values

In [22]:
# Example 2
# In this example, we will insert students tuples in STUDENTS table.
# Then we will fetch all the data from the table

%%sql INSERT INTO STUDENT (StudentID, LastName)
VALUES ('21','Wang'),
      ('13','Batini'),
        ('32','Xu');
SELECT * from STUDENT;

 * sqlite:///mydb.sqlite
3 rows affected.
Done.

[('21', 'Wang'), ('13', 'Batini'), ('32', 'Xu')]

In [19]:
# Example 3
# In this example, we will insert students tuples in STUDENTS table.
# Then we will fetch all the data from the table
%%sql DROP TABLE STUDENT;

 * sqlite:///mydb.sqlite
Done.

[]

## 1.5 Inserting values from a local file

In [23]:
# Example 4
# In this example, we will create a COURSE table for a student management system.
# This will be imported from a CSV file on a local csv file in the Files directory
# First, grab the file from https://www.dropbox.com/s/zp9v160frc6c4lw/COURSE.csv?dl=0
# and upload it in the folder Files you have in the first column (click on the Folder icon)
# Then fetch all records from COURSE table.
#
# Load example table with Pandas
# Connect to local dabatase
import sqlite3
cnx = sqlite3.connect('mydb.sqlite')

import pandas as pd
df = pd.read_csv('COURSE.csv', sep=';')

# Dump it to sqlite!
df.to_sql(name='COURSE', if_exists='replace', index=False, con=cnx)

# Bye bye
cnx.close()

In [24]:
%%sql
SELECT * From COURSE;

 * sqlite:///mydb.sqlite
Done.

[(3, 'Algorithms'), (7, 'Databases')]

## 1.6 Creating a table and inserting partial data

In [25]:
# Example 5
# In this example, we will create a EXAM table for a student management system.
#
%sql CREATE TABLE EXAM (StudentID, CourseID, Grade);

 * sqlite:///mydb.sqlite
Done.

[]

In [26]:
# Example 6
# In this example, we will insert two tuples in the EXAM table for a student management system.
#

%%sql INSERT INTO EXAM (StudentID, CourseID, Grade)
VALUES
      (13, 3, 26),
      (13,7,30),
      (32,7,28);

 * sqlite:///mydb.sqlite
3 rows affected.

[]

In [28]:
# Example 7
# In this example, we will insert a tuple in the EXAM table with CourseID 7 for StudentID 13.
#
%%sql INSERT INTO EXAM (StudentID, CourseID, Grade)
VALUES
      (13,7,'');
SELECT * FROM EXAM;

 * sqlite:///mydb.sqlite
1 rows affected.
Done.

[(13, 3, 26), (13, 7, 30), (32, 7, 28), (13, 7, '')]

## 1.8 Joining tables

In [30]:
# Example 8
# In this example, we will select the names of the courses in which Students are registered (join of tables)
#

%%sql
SELECT NAME
FROM COURSE JOIN EXAM
GROUP BY NAME

 * sqlite:///mydb.sqlite
Done.

[('Algorithms',), ('Databases',)]

In [31]:
# Example 9
# In this example, we will modify the EXAM table to be able to insert Cum Laude grades, adding a new column Laude
#
%%sql ALTER TABLE EXAM
ADD Laude;
SELECT * From EXAM;

 * sqlite:///mydb.sqlite
Done.
Done.

[(13, 3, 26, None), (13, 7, 30, None), (32, 7, 28, None), (13, 7, '', None)]

In [32]:
# Example 10
# In this example, we will update the grade for student 32 in course 7 in the EXAM table
# to indicate a Cum Laude (L)
#
%%sql
UPDATE EXAM
SET Laude="L"
WHERE StudentID = 32 AND CourseID= 7;
SELECT * FROM EXAM;

 * sqlite:///mydb.sqlite
1 rows affected.
Done.

[(13, 3, 26, None), (13, 7, 30, None), (32, 7, 28, 'L'), (13, 7, '', None)]

#Views

In [38]:
# Example 11
#Create a view for user 13 (Batini)
#DROP VIEW needed in case you rerun this cell
#using
#CREATE VIEW V13 (CourseID, CourseName) AS then a SQL query

%%sql
DROP VIEW if exists V13;

CREATE VIEW V13 (CourseID, Name) AS
SELECT Exam.CourseID, COURSE.Name
FROM EXAM JOIN COURSE USING (CourseID)
WHERE StudentID=13;

SELECT * FROM V13;

 * sqlite:///mydb.sqlite
Done.
Done.
Done.

[(3, 'Algorithms'), (7, 'Databases'), (7, 'Databases')]

## 1.9 About the structure of a table

In [39]:
# Example 12
# To show the structure of a table
# We do the following as shown below.
#
%%sql
PRAGMA  table_info(EXAM)

 * sqlite:///mydb.sqlite
Done.

[(0, 'StudentID', '', 0, None, 0),
 (1, 'CourseID', '', 0, None, 0),
 (2, 'Grade', '', 0, None, 0),
 (3, 'Laude', '', 0, None, 0)]

# Constraints

In [ ]:
# Example 13
# To specify domains and default values for the fields in a new table TeamMembers,
# We do the following as shown below.
#
%%sql
CREATE TABLE IF NOT EXISTS TeamMembers (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER DEFAULT 'Unknown',
    height REAL);

PRAGMA  table_info(TeamMembers)

In [ ]:
# Example 14
# To specify domains and default values for the fields in a new table TeamMembers,
# We do the following as shown below.
#
%%sql
CREATE TABLE Persons (
PersonID int,
LastName varchar(255),
FirstName varchar(255),
Address varchar(255),
City varchar(255)
);

PRAGMA  table_info(Persons)

In [ ]:
#with PRAGMA analyse the COURSE and EXAM tables

## 1.10 SQL result set to a local variable and then to CSV

In [ ]:
# Example 15
# To export the result of a query to a local variable result_set

%%sql
result_set << SELECT * FROM EXAM;

In [ ]:
# Example 16
# And then to a CSV file (in local folders Files)

df = result_set.DataFrame()
df.to_csv('EXAM.csv', index=False, sep=';')

#alternative
#result_set.DataFrame().to_csv('EXAM.csv', index=False, sep=';')

In [ ]:
#see the file  !head <filename> shows the first 10 lines


!head EXAM.csv

In [ ]:
#to see the whole file (in this case is the same)

!cat EXAM.csv

In [ ]:
#export also STUDENT

%%sql
result_set << SELECT * FROM STUDENT;

In [ ]:
df = result_set.DataFrame()
df.to_csv('STUDENT.csv', index=False, sep=';')

In [ ]:
#an alternative
#SQL and Python in the same cell

%sql result_set << SELECT * FROM STUDENT;
df = result_set.DataFrame()
df.to_csv('STUDENT2.csv', index=False, sep=';')

## <font color="green"> 1.11 Challenges</font>

In [ ]:
# Challenge 1
# Let's create 3 Tables Customer, Product, Sale
# Each has a key, attributes for describing them (e.g. Name, age for customers, brand for Products)
# Sales contains tuples indicating sales of products to customers, with Quantity and Date
# Insert 2 customers and 3 products
# Insert a tuple into Sale
# Display the age of Customers and Date for each sale
# Tip1: you can also create csv files and upload them as shown in Example 4
# Tip2: if you want to delete a table and its contents to restart you can use
# DROP TABLE TableName;

%%sql
CREATE TABLE IF NOT EXISTS ....(